# ConvertToArcPolyline

## Description
Convert, within a tolerance, the input polyline into an polyline that uses arcs for the curves

```pascal
FUNCTION ConvertToArcPolyline(
				hPolygon : HANDLE;
				dFuzz    : REAL) : HANDLE;
```

```python

def vs.ConvertToArcPolyline(hPolygon, dFuzz):
    return HANDLE
```

## Parameters
|Name|Type|Description|
|---|---|---|
|hPolygon|HANDLE||
|dFuzz|REAL||

## Version
Availability: from Vectorworks 2014
## Category
* Graphic Calculation